import type { MeetingRequest } from "@/types/meeting-request";

export const MOCK_PENDING_REQUESTS: MeetingRequest[] = [
  {
    id: "1",
    type: "external",
    title: "مراجعة الأعمال والجدول اليومية",
    description:
      "رعاية توقيع مذكرة تفاهم بين وزارة البلديات والإسكان وصندوق البنية التحتية وشركة سدكو المالية",
    goal: "الاجتماع اليومي للمؤامة مع معا الوزير حول الدول وتحديثات العمل والأعمال",
  },
  {
    id: "2",
    type: "internal",
    title: "مراجعة الأعمال والجدول اليومية",
    description:
      "رعاية توقيع مذكرة تفاهم بين وزارة البلديات والإسكان وصندوق البنية التحتية وشركة سدكو المالية",
    goal: "الاجتماع اليومي للمؤامة مع معا الوزير حول الدول وتحديثات العمل والأعمال",
  },
  {
    id: "3",
    type: "internal",
    title: "مراجعة الأعمال والجدول اليومية",
    description:
      "رعاية توقيع مذكرة تفاهم بين وزارة البلديات والإسكان وصندوق البنية التحتية وشركة سدكو المالية",
    goal: "مذكرة تفاهم لدعم تطوير وتعزيز واستثمار الحدائق العامة بالمملكة.",
  },
  {
    id: "4",
    type: "private",
    title: "مراجعة الأعمال والجدول اليومية",
    description:
      "رعاية توقيع مذكرة تفاهم بين وزارة البلديات والإسكان وصندوق البنية التحتية وشركة سدكو المالية",
    goal: "مذكرة تفاهم لدعم تطوير وتعزيز واستثمار الحدائق العامة بالمملكة.",
  },
  {
    id: "5",
    type: "internal",
    title: "مراجعة الأعمال والجدول اليومية",
    description:
      "رعاية توقيع مذكرة تفاهم بين وزارة البلديات والإسكان وصندوق البنية التحتية وشركة سدكو المالية",
    goal: "الاجتماع اليومي للمؤامة مع معا الوزير حول الدول وتحديثات العمل والأعمال",
  },
  {
    id: "6",
    type: "new",
    title: "مراجعة الأعمال والجدول اليومية",
    description:
      "رعاية توقيع مذكرة تفاهم بين وزارة البلديات والإسكان وصندوق البنية التحتية وشركة سدكو المالية",
    goal: "مذكرة تفاهم لدعم تطوير وتعزيز واستثمار الحدائق العامة بالمملكة.",
  },
  {
    id: "7",
    type: "councils",
    title: "مراجعة الأعمال والجدول اليومية",
    description:
      "رعاية توقيع مذكرة تفاهم بين وزارة البلديات والإسكان وصندوق البنية التحتية وشركة سدكو المالية",
    goal: "الاجتماع اليومي للمؤامة مع معا الوزير حول الدول وتحديثات العمل والأعمال",
  },
  {
    id: "8",
    type: "internal",
    title: "مراجعة الأعمال والجدول اليومية",
    description:
      "رعاية توقيع مذكرة تفاهم بين وزارة البلديات والإسكان وصندوق البنية التحتية وشركة سدكو المالية",
    goal: "مذكرة تفاهم لدعم تطوير وتعزيز واستثمار الحدائق العامة بالمملكة.",
  },
];

export const MOCK_SCHEDULED_REQUESTS: MeetingRequest[] = MOCK_PENDING_REQUESTS.slice(0, 4);
